{"adapted":null,"original":{"recipe":{"id":"4fdff990-41e8-11ed-9acf-21e9fcd714d6","attr_url":null,"attr_slug":"oksana-f3b935","based_on":null,"based_on_title":null,"deleted":null,"directions":[{"title":"","directions":["In a large mixing bowl or measuring cup, combine the warm milk (110 F), yeast, sugar, butter, and eggs. Stir and set aside to foam for 3 mins.\nPro tip- Instant yeast does not need to be activated. But I like to ensure my yeast is good and working for me. You may choose to add all ingredients directly to the flour.","Using a kitchen scale measure the flour and salt in a mixing bowl or stand mixer with the dough hook. Add the yeast mixture and combine well.\nPro tip - If you do not like kneading, I highly recommend using a stand mixer with the hook attachment.","Knead\n- By hand - transfer to a well-dusted worktop and knead for 5 to 6 minutes\n- Stand mixer - once all the flour is well incorporated knead on medium for 4 to 5 minutes","When the dough is soft, shiny, but still slightly sticky shape into a ball. Place the dough in an oiled bowl seam side down. Coat the surface with oil to prevent drying. Cover with a clean kitchen cloth or plastic wrap.\nPro tip - You want the dough to be really really soft, a little sticky. But it has to be elastic! This is what will give us soft hamburgers.","Leave in a warm place. Let rise for 60 to 90 minutes until double in volume.\nPro tip - In winter, you may need 90 minutes or more. But in summer, the dough may double in 45 minutes. If you can't attend to it at that moment, de-gas, reshape, and let double in volume again.","When the dough is double in volume, transfer to a well-dusted floured surface. De-gas, reshape into a ball. Then roll into a small log.\nPro tip - At this point, there is no need for additional flour. So use a light dusting of flour.","Using a bench scraper divide the dough into 12 buns (110 grams each) or 16 buns (80 g each) depending on how big you want the burgers. (120 grams is too much, try about 90 next time, and remember they rise quite round)\nPro tip - For 6 oz / 150 grams size beef patties make 10 buns for 9 oz / 250 grams beef patties make only 8 buns.","Shape each portion into a tight ball. To do this correctly, roll into a ball tucking all the seams under tightly. Then, roll the ball on an unfloured surface. The unfloured surface creates the tension we need in the dough\nPro tip - Do not over roll these for too long or you will rupture the top smooth skin.","Place the buns on a baking tray. Flatten them so they bake like flat buns rather than balls. Cover with a plastic wrap or clean kitchen cloth and let proof for 30 to 45 minutes.\nPro tip - Spray the plastic wrap with oil to prevent it from sticking to the rolls.","When almost doubled in size, about 20 minutes before baking, preheat the oven at 375°F /190°C","Brush each bun with an egg wash and sprinkle on some sesame seeds.\nPro tip - Egg wash is a full egg with 2 tablespoon of water. An egg wash will give a nice golden color. If you can't use egg, milk or cream will work just as well. Do not use oil or butter as it will create a crust.","Bake small buns for 15 to 20 mins and larger buns for about 20 to 25 minutes or until golden brown.\nPro tip - When baked, the internal temperature of the hamburgers buns should be about 195 F. The bread will have a hollow sound on the bottom when tapped.","Keeping them soft - as soon as you take the burgers out of the oven cover them with a clean kitchen cloth to keep them soft.\nPro tip - Do not leave the buns on the tray for too long as the steam will make the bread soggy on the bottom. Covering the buns with a cloth will help them retain moisture and prevent it from drying out.",""]}],"img":null,"image_urls":{"120":"/prepear-prod/09217070-3f88-11ea-b6e4-8e60f60ec31b/4fdff990-41e8-11ed-9acf-21e9fcd714d6/733a59b0-41ea-11ed-91db-9f91d10eeaa9.jpg","640":"/prepear-prod/09217070-3f88-11ea-b6e4-8e60f60ec31b/4fdff990-41e8-11ed-9acf-21e9fcd714d6/7366c0e0-41ea-11ed-a898-a52ce57cdca9.jpg","1080":"/prepear-prod/09217070-3f88-11ea-b6e4-8e60f60ec31b/4fdff990-41e8-11ed-9acf-21e9fcd714d6/73a5ecc0-41ea-11ed-9276-6aeb086ae975.jpg"},"imported_user_id":null,"imported_at":null,"ingredients":[{"title":"Dough","ingredients":[{"note":"about 41 C or 110 F","amount":"400","verified":false,"submitted":false,"measurement":"g","ingredient_id":null,"ingredient_name":"12/3 cups Warm milk"},{"amount":"100","verified":false,"submitted":false,"measurement":"g","ingredient_id":null,"ingredient_name":"(2 large) Eggs"},{"note":"unsalted","amount":"75","verified":false,"submitted":false,"measurement":"g","ingredient_id":null,"ingredient_name":"(5 tablespoon) Melted butter"},{"amount":"40","verified":false,"submitted":false,"measurement":"g","ingredient_id":null,"ingredient_name":"(3 tablespoon) Sugar"},{"amount":"10 g","verified":false,"submitted":false,"measurement":"g","ingredient_id":null,"ingredient_name":"(3 teaspoon) Instant dry yeast"},{"note":"or all-purpose flour","amount":"710","verified":false,"submitted":false,"measurement":"g","ingredient_id":null,"ingredient_name":"( 5.75 cups) Bread flour"},{"amount":"15","verified":false,"submitted":false,"measurement":"g","ingredient_id":null,"ingredient_name":"(21/2 teaspoon) Kosher salt"}]},{"title":"Glaze","ingredients":[{"amount":"1","verified":true,"measurement":"","ingredient_id":"fb2c04d7-dc71-11e6-b41b-810a1dc588d1","ingredient_name":"egg"},{"amount":"1","verified":true,"measurement":"tbsp","ingredient_id":"02368a18-dc72-11e6-b185-38724a0a4835","ingredient_name":"water"},{"amount":"2","verified":false,"measurement":"tbsp","ingredient_id":null,"ingredient_name":"seseame seeds"}]}],"is_import":null,"nutrients":{},"owner_id":"09217070-3f88-11ea-b6e4-8e60f60ec31b","partner_id":null,"privacy":"public","serving_size":"","servings":null,"tags":[],"time_cook":"","time_prep":"","title":"Burger buns  - makes 16 or so, half the recipe!","weight":null,"reminders":[],"notes":["https://veenaazmanov.com/soft-burger-buns/#bakers-schedule"],"broken_attr_url":null,"system_tags":null,"owner":{"id":"09217070-3f88-11ea-b6e4-8e60f60ec31b","display_name":"Oksana","picture":null,"slug":"oksana-f3b935","type":null,"image_urls":null},"adsEnabled":false,"purchased":false,"bookmarked":true},"totals":{"favorited":null,"prepeared":null,"planned":null,"revenue":null,"reviewed":null,"reviewed_sum":null,"bookmarked":1},"reviews":[],"meta":{"user_id":"09217070-3f88-11ea-b6e4-8e60f60ec31b","recipe_id":"4fdff990-41e8-11ed-9acf-21e9fcd714d6","preferred_adapted_id":null,"bookmarked":true,"comments":null,"img":null,"image_urls":null,"prepeared":null,"notes":[],"rating":null,"review_id":null,"tags":[],"import_added":null,"purchased":null,"reminders":[]}}}
